dict_active = {
    "Аэробика":420,
    "Аквааэробика":240,
    "Гимнастика":480,
    "Скакалка":750,
    "Йога": 225,
    "Кручение обруча": 375,
    "Пилатес": 150,
    "Современные танцы": 350,
    "Занятия балетом": 750,
    "Бальные танцы": 275,
    "Танцы в ритме диско": 400,
    "Фигурное катание": 300,
    "Ходьба на лыжах": 485,
    "Скоростной спуск на лыжах": 270,
    "Скоростной бег на коньках": 770,
    "Водное поло": 600,
    "Плавание": 300,
    "Гребля академическая": 210,
    "Водные лыжи": 355,
    "Тренажеры, бодибилдинг": 600,
    "Тай-бо": 800,
    "Пресс": 300,
    "Бокс": 750,
    "Ходьба": 200,
    "Бег трусцой": 500,
    "Роликовые коньки": 420,
    "Бадминтон": 405,
    "Боулинг": 270,
    "Гольф": 250,
    "Теннис": 400,
    "Баскетбол": 380,
    "Езда на велосипеде": 320,
    "Гребля на каноэ": 185,
    "Хоккей на траве": 490,
    "Фехтование": 210,
    "Футбол": 450,
    "Гандбол": 485,
    "Езда верховая": 255,
    "Альпинизм": 453,
    "Настольный теннис": 200,
    "Волейбол": 255,
    "Подстригание газона": 250,
    "Работа в саду": 220,
    "Инфракрасная сауна": 1000,
    "Колка дров": 400,
    "Мытье полов": 130
    }


async def get_activity_value(activity_name):
    activity_name_lower = activity_name.lower()
    dict_active_lower = {key.lower(): value for key, value in dict_active.items()}

    if activity_name_lower in dict_active_lower:
        return dict_active_lower[activity_name_lower]

    else:
        activities_list = "\n".join(dict_active.keys())
        raise ValueError(
            f"Активность '{activity_name}' не найдена в списке активностей.\n"
            f"Доступные активности:\n{activities_list}\n\n"
            f"Введите одну из доступных активностей"
        )